#include <stdio.h>

int main() {
    // กำหนดตัวแปร i เริ่มต้นที่ 1
    int i = 1;

    // ใช้ลูป do-while เพื่อวนลูปจาก 1 ถึง 10 
    do {
        if (i == 6) { // ถ้า i เท่ากับ 6
            i++; // เพิ่มค่า i ก่อนใช้ 
            continue; // ข้ามการแสดงผลเมื่อ i เป็น 6
        }
        printf("%d ", i); // แสดงค่าของ i
        
        i++; // เพิ่มค่า i ทีละ 1 ในแต่ละรอบ
    }
    while (i <= 10); // ตรวจสอบเงื่อนไขหลังจากรันบล็อก do แล้ว

    return 0; // จบการทำงานของโปรแกรม
}